Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Since the session has to be created but the OAuth2 provider does not return an ID token which can be used to calculate the session age, an `quarkus.oidc.authentication.internal-id-token-lifespan` duration property can be used to set the session lifespan. When the OAuth2 server returns an access token `expires_in` property then this property is used as a session age property, if `quarkus.oidc.authentication.internal-id-token-lifespan` is not configured.
ja_jp: セッションを作成する必要がありますが、OAuth2 プロバイダーはセッションの有効期間を計算するために使用できる ID トークンを返さないため、 `quarkus.oidc.authentication.internal-id-token-lifespan` 期間プロパティーを使用してセッションの有効期間を設定できます。OAuth2 サーバーがアクセストークンの `expires_in` プロパティーを返す場合、 `quarkus.oidc.authentication.internal-id-token-lifespan` が設定されていなければ、そのプロパティーがセッション有効期間プロパティーとして使用されます。

source: Since the tour began, we have performed for crowds of developers from *15+* JUGs across the world with many more https://quarkus.io/worldtour/[tour stops] being added every day.
ja_jp: このツアーが始まって以来、私たちは世界中の *15以上の* JUGから集まった大勢の開発者を前にパフォーマンスを行ってきましたが、毎日多くの link:https://quarkus.io/worldtour/[ツアー会場]が追加されています。

source: Since the transaction has not yet been committed the changes made by the flight and taxi services are not visible outside of the transaction.
ja_jp: このトランザクションはまだコミットされていないため、フライトやタクシーサービスによって行われた変更は、トランザクションの外からは見えません。

source: Since the transaction has not yet been committed the changes made by the flight and taxi services are not visible outside the transaction.
ja_jp: このトランザクションはまだコミットされていないため、フライトやタクシーサービスによって行われた変更は、トランザクションの外からは見えません。

source: Since then, we have made a lot of progress and everything is in place to support external extensions, be they hosted in the https://github.com/quarkiverse/[Quarkiverse Hub] or in other organizations/repositories.
ja_jp: それ以来、私たちは多くの進歩を遂げ、それが link:https://github.com/quarkiverse/[Quarkiverse Hub]でホストされているものであれ、他の組織やリポジトリでホストされているものであれ、外部のエクステンションをサポートするためのすべてが整っています。

source: Since this class is never instantiated and its method are never invoked, this is okay, but it's also possible to create a non-`abstract` class:
ja_jp: このクラスはインスタンス化されることはなく、そのメソッドが呼び出されることもないので、これで問題ありませんが、非 `abstract` クラスを作成することも可能です。

source: Since this is not always possible, there is an option to achieve the same via `application.properties`. The `quarkus.arc.unremovable-types` property accepts a list of string values that are used to match beans based on their name or package.
ja_jp: これは常に可能ではないので、 `application.properties` を通して同じことを実現するオプションがあります。 `quarkus.arc.unremovable-types` プロパティーは、Bean の名前やパッケージに基づいて一致させるための文字列値のリストを受け付けます。

source: Since virtual threads are disposable entities, the fundamental idea of `@RunOnVirtualThread` is to offload the execution of an endpoint handler on a new virtual thread instead of running it on an event-loop or worker thread (in the case of Quarkus REST).
ja_jp: 仮想スレッドは使い捨てのエンティティーであるため、 `@RunOnVirtualThread` の基本的な考え方は、エンドポイントハンドラーの実行をイベントループやワーカースレッド (Quarkus REST の場合) で実行する代わりに、新しい仮想スレッド上でオフロードすることです。

source: Since virtual threads are disposable entities, the fundamental idea of `@RunOnVirtualThread` is to offload the execution of an endpoint handler on a new virtual thread instead of running it on an event-loop or worker thread (in the case of RESTEasy Reactive).
ja_jp: 仮想スレッドは使い捨てのエンティティであるため、 `@RunOnVirtualThread` の基本的な考え方は、エンドポイントハンドラの実行をイベントループやワーカースレッド（RESTEasy Reactiveの場合）で実行する代わりに、新しい仮想スレッド上でオフロードすることです。

source: Since virtual threads are disposable entities, the fundamental idea of quarkus-loom is to offload the execution of an endpoint handler on a new virtual thread instead of running it on an event-loop (in the case of RESTeasy-reactive) or a platform worker thread.
ja_jp: 仮想スレッドは使い捨てのエンティティなので、quarkus-loomの基本的な考え方では、エンドポイントハンドラをイベントループ（RESTeasy-reactiveの場合）やプラットフォームワーカスレッドで実行せずに新しい仮想スレッドでオフロードします。

source: Since we approached this as a ground up rewrite of our existing Spring Boot platform there were many changes that needed to happen. The codebase was new but patterns were the same and using Quarkus we were able to implement them easier, faster, and better.
ja_jp: このプロジェクトは、既存のSpring Bootプラットフォームの全面的な書き換えとして取り組んだため、多くの変更が必要となりました。コードベースは新しくなりましたが、パターンは同じで、Quarkusを使用することで、より簡単に、より速く、より良く実装することができました。

source: Since we are still using the same application resource file and external coordinator there is no need to update the config.
ja_jp: 同じアプリケーションリソースファイルと外部コーディネーターを使用しているので、設定を更新する必要はありません。

source: Since we configured `greetingService` as a mock, the `GreetingResource` which uses the `GreetingService` bean, we get the mocked response instead of the response of the regular `GreetingService` bean
ja_jp: `greetingService` をモックとして設定したので、 `GreetingService` Beanを使用する `GreetingResource` は、通常の `GreetingService` Beanのレスポンスの代わりにモックされたレスポンスを取得します。

source: Since we want to respond to the HTTP GET verb, we override the `doGet` method and write `Hello` in the Servlet response's output stream.
ja_jp: HTTP GET 動詞に応答したいので、 `doGet` メソッドをオーバーライドして、サーブレット応答の出力ストリームに `Hello` を記述します。

source: Since we're dealing with a linux native executable, we can use tools like `perf` directly. To use `perf`, go to the root of the project and start the tools container created earlier as a privileged user:
ja_jp: Linux のネイティブ実行可能ファイルを扱っているので、 `perf` のようなツールを直接使用できます。 `perf` を使用するには、プロジェクトの root に移動し、特権ユーザーとして以前に作成したツールコンテナーを起動します。

source: Since we’re not limited to standards we can go beyond and extend your possibilities. Of course, Quarkus is not a passive consumer. Our goal is to improve and innovate the technologies we use and contribute back to the open source projects and standards we rely on.
ja_jp: 標準に限定されていないため、私たちはそれらを超えて、あなたの可能性を広げることができます。もちろん、Quarkus は受動的な消費者ではありません。私たちの目標は、使用するテクノロジーを改善し革新し、私たちが依存するオープンソースプロジェクトや標準に貢献することです。

source: Since your extension deployment is made during the application build, this process is triggered by your build tool. That means if you want to debug this phase you need to launch your build tool with the remote debug mode switched on.
ja_jp: エクステンションのデプロイはアプリケーションのビルド中に行われるため、このプロセスはビルドツールによって起動されます。 つまり、このフェーズをデバッグしたい場合は、リモートデバッグモードをオンにしてビルドツールを起動する必要があります。

source: Since your extension deployment is made during the application build, this process is triggered by your build tool. That means if you want to debug this phase you need to launch your build tool with the remote debug mode switched one.
ja_jp: エクステンションのデプロイはアプリケーションのビルド中に行われるため、このプロセスはビルドツールによってトリガーされます。つまり、このフェーズをデバッグしたい場合は、リモートデバッグモードを 1 に切り替えてビルドツールを起動する必要があります。

source: Single Page Application (SPA) typically uses `XMLHttpRequest`(XHR) and the Java Script utility code provided by the OpenID Connect provider to acquire a bearer token and use it to access Quarkus `service` applications.
ja_jp: シングルページアプリケーション(SPA)は通常、 `XMLHttpRequest` (XHR)とOpenID Connectプロバイダーが提供するJava Scriptユーティリティーコードを使用してベアラートークンを取得し、それを使用してQuarkus `service` アプリケーションにアクセスします。

source: Single Page Application (SPA) typically uses `XMLHttpRequest`(XHR) and the JavaScript utility code provided by the OpenID Connect provider to acquire a bearer token and use it to access Quarkus `service` applications.
ja_jp: シングルページアプリケーション (SPA) は通常、 `XMLHttpRequest` (XHR) と OpenID Connect プロバイダーが提供する JavaScript ユーティリティーコードを使用してBearer Tokenを取得し、それを使用してQuarkus `service` アプリケーションにアクセスします。

source: Single Page Application (SPA) typically wants to avoid redirects, this can be done by removing default page paths:
ja_jp: シングルページアプリケーション（SPA）は通常、リダイレクトを避けたいものですが、これはデフォルトページパスを削除することによって実現できます:

source: Single Page Applications
ja_jp: シングルページアプリケーション

source: Single Thread
ja_jp: シングルスレッド

source: Single page application (SPA) public clients generate DPoP proof tokens and use them to acquire and submit access tokens which are cryptograhically bound to DPoP proofs.
ja_jp: シングル・ページ・アプリケーション（SPA）のパブリック・クライアントはDPoPプルーフ・トークンを生成し、DPoPプルーフに暗号学的にバインドされたアクセストークンの取得と提出に使用します。

source: Single sign-on (SSO)
ja_jp: シングルサインオン (SSO)

source: Single-command Kubernetes deployment
ja_jp: シングルコマンドでのKubernetesへのデプロイ

source: Single-page applications
ja_jp: シングルページアプリケーション

source: Single-step Deployments
ja_jp: シングルステップのデプロイメント

source: Singletons that rely on `enum` classes are also affected by the same issue:
ja_jp: `enum` クラスに依存しているシングルトンも同じ問題の影響を受けます。

source: Singletons that rely on static variable initialization will suffer similar problems. For example, imagine you have a singleton based around static initialization along with a REST endpoint to query it:
ja_jp: 静的変数の初期化に依存するシングルトンは、同様の問題に悩まされます。たとえば、クエリーを実行する REST エンドポイントと共に、静的初期化に基づくシングルトンがあるとします。

source: Six months later and almost everything has been rebuilt from the ground-up.
ja_jp: 半年後、ほとんどのものが一から作り直されました。

source: Size
ja_jp: サイズ

source: Size of a consumer's receiver queue. + For example, the number of messages accumulated by a consumer before an application calls `Receive`. + A value higher than the default value increases consumer throughput, though at the expense of more memory utilization.
ja_jp: コンシューマの受信キューのサイズ。 例えば、アプリケーションが `Receive` を呼び出す前に、コンシューマに蓄積されるメッセージ数。 デフォルト値より大きい値を設定すると、メモリ使用量が増加しますが、コンシューマのスループットが向上します。

source: Size of a memory chunk in pooled allocator
ja_jp: プールされたアロケーターのメモリーチャンクサイズ

source: Size of the buffer cache
ja_jp: バッファーキャッシュのサイズ

source: Skip creating its own default Dev Service container
ja_jp: 独自のデフォルト Dev Service コンテナーの作成をスキップします

source: Skipping class initialization
ja_jp: クラス初期化のスキップ

source: Skipping code generation
ja_jp: コード生成をスキップする

source: Skipping reply
ja_jp: 返信をスキップする

source: Slightly related, you can now define the Java version you want to use in your generated projects. For instance with:
ja_jp: 少し関連しますが、生成されたプロジェクトで使用するJavaのバージョンを定義できるようになりました。例えば、次のようにします:

source: Slower for I/O operations because it requires copying data to/from direct memory before sending over a socket.
ja_jp: ソケット経由で送信する前にデータをダイレクトメモリにコピーする必要があるため、I/O 操作が遅くなります。

source: Small REST application
ja_jp: 小規模 REST アプリケーション

source: Small issue with IDEs
ja_jp: IDEに関する小さな課題

source: SmallRye Config SecretKeys support
ja_jp: SmallRye Config SecretKeyのサポート

source: SmallRye Config may provide handlers not fully supported by Quarkus. Currently, only `smallrye-config-crypto` is supported.
ja_jp: SmallRye Configは、Quarkusが完全にサポートしていないハンドラを提供する場合があります。現在のところ、 `smallrye-config-crypto` のみがサポートされています。

source: SmallRye Config specifies link:https://smallrye.io/smallrye-config/Main/config/environment-variables/[additional conversion rules].
ja_jp: SmallRye Configでは、 link:https://smallrye.io/smallrye-config/Main/config/environment-variables/[追加の変換ルール] を指定しています。

source: SmallRye Config specifies link:https://smallrye.io/smallrye-config/latest/config/environment-variables/[additional conversion rules].
ja_jp: SmallRye Config は link:https://smallrye.io/smallrye-config/latest/config/environment-variables/[追加の規約ルール] を指定します。

source: SmallRye Context Propagation
ja_jp: SmallRye コンテキスト伝搬

source: SmallRye Fault Tolerance
ja_jp: SmallRyeのフォールト・トレランス

source: SmallRye Fault Tolerance allows to improve resiliency of your application, without having an impact on the complexity of our business logic.
ja_jp: SmallRye Fault Toleranceは、ビジネスロジックの複雑さに影響を与えることなく、アプリケーションの耐障害性を向上させます。

source: SmallRye Fault Tolerance has more features than shown here. Please check the link:https://smallrye.io/docs/smallrye-fault-tolerance/5.2.0/index.html[SmallRye Fault Tolerance documentation] to learn about them.
ja_jp: SmallRye Fault Toleranceには、ここに示した以外にも多くの機能があります。これらの機能については、 link:https://smallrye.io/docs/smallrye-fault-tolerance/5.2.0/index.html[SmallRye Fault Toleranceのドキュメント] を参照してください。

source: SmallRye Fault Tolerance has more features than shown here. Please check the link:https://smallrye.io/docs/smallrye-fault-tolerance/5.5.0/index.html[SmallRye Fault Tolerance documentation] to learn about them.
ja_jp: SmallRye Fault Toleranceには、ここで紹介した以外にも様々な機能があります。それらについては、 link:https://smallrye.io/docs/smallrye-fault-tolerance/5.2.0/index.html[SmallRye Fault Toleranceのドキュメント]をご確認ください。

source: SmallRye Fault Tolerance has more features than shown here. Please check the link:https://smallrye.io/docs/smallrye-fault-tolerance/6.10.0/index.html[SmallRye Fault Tolerance documentation] to learn about them.
ja_jp: SmallRye Fault Toleranceには、ここで紹介した以外にも多くの機能があります。これらの機能については、 link:https://smallrye.io/docs/smallrye-fault-tolerance/6.10.0/index.html[SmallRye Fault Toleranceのドキュメント] を参照してください。

source: SmallRye Fault Tolerance has more features than shown here. Please check the link:https://smallrye.io/docs/smallrye-fault-tolerance/6.2.6/index.html[SmallRye Fault Tolerance documentation] to learn about them.
ja_jp: SmallRye Fault Toleranceには、ここに示した以外にも多くの機能があります。 これらの機能については、 link:https://smallrye.io/docs/smallrye-fault-tolerance/6.2.6/index.html[SmallRye Fault Toleranceのドキュメント] を参照してください。

source: SmallRye GraphQL Client
ja_jp: SmallRye GraphQLクライアント

source: SmallRye GraphQL enables clients to retrieve the exact data that is required preventing `Over-fetching` and `Under-fetching`.
ja_jp: SmallRye GraphQL は、クライアントが `Over-fetching` や `Under-fetching` を防ぐために必要なデータを正確に取得することを可能にします。

source: SmallRye Health Checks, Micrometer and Info endpoints will be declared as management endpoints when the management interface is enabled.
ja_jp: マネジメントインタフェースが有効な場合、SmallRye Health Checks、Micrometer、Info の各エンドポイントはマネジメントエンドポイントとして宣言されます。

source: SmallRye Health Checks, SmallRye Metrics, Micrometer and Info endpoints will be declared as management endpoints when the management interface is enabled.
ja_jp: SmallRye Health Checks、SmallRye Metrics、Micrometer、Infoの各エンドポイントは、マネジメントインタフェースを有効にすると、マネジメントエンドポイントとして宣言されます。

source: SmallRye Health Checks, SmallRye Metrics, and Micrometer endpoints will be declared as management endpoints when the management interface is enabled.
ja_jp: SmallRye Health Checks、SmallRye Metrics、およびMicrometerの各エンドポイントは、マネジメントインタフェースが有効化されると、マネジメントエンドポイントとして宣言されます。

source: SmallRye Health Checks, and Micrometer endpoints will be declared as management endpoints when the management interface is enabled.
ja_jp: マネジメントインタフェースが有効な場合、SmallRye Health Checks および Micrometer の各エンドポイントはマネジメントエンドポイントとして宣言されます。

source: SmallRye Health allows applications to provide information about their state to external viewers which is typically useful in cloud environments where automated processes must be able to determine whether the application should be discarded or restarted.
ja_jp: SmallRye Healthは、アプリケーションがその状態に関する情報を外部のビューアーに提供することを可能にします。これは、典型的には自動化されたプロセスがアプリケーションを破棄すべきか再起動すべきかを判断できなければならないクラウド環境において、有用です。

source: SmallRye Health provides a way for your application to distribute information about its healthiness state to state whether it is able to function properly. Liveness checks are utilized to tell whether the application should be restarted and readiness checks are used to tell whether the application is able to process requests.
ja_jp: SmallRye Healthは、アプリケーションが正常に機能できるかどうかを示すために、 アプリケーションの健全性に関する情報を得る方法を提供します。Liveness チェックは、アプリケーションを再起動すべきかどうかを判断するために使用され、Readinessチェックは、アプリケーションがリクエストを処理できるかどうかを判断するために使用されます。

source: SmallRye Health provides a way for your application to distribute information about its healthiness state to state whether or not it is able to function properly. Liveness checks are utilized to tell whether the application should be restarted and readiness checks are used to tell whether the application is able to process requests.
ja_jp: SmallRye Healthは、アプリケーションが正常に機能できるかどうかを表明するために、その健全性の状態に関する情報を配布する方法を提供します。Liveness チェックは、アプリケーションを再起動すべきかどうかを判断するために使用され、Readinessチェックは、アプリケーションがリクエストを処理できるかどうかを判断するために使用されます。

source: SmallRye JWT Build provides an API for securing JWT claims using all of these options. link:https://bitbucket.org/b_c/jose4j/wiki/Home[Jose4J] is used internally to support this API.
ja_jp: SmallRye JWT Build は、これらすべてのオプションを使用して JWT クレームを保護するための API を提供します。link:https://bitbucket.org/b_c/jose4j/wiki/Home[Jose4J] は、この API をサポートするために内部で使用されます。

source: SmallRye JWT Builder configuration
ja_jp: SmallRye JWT Builder の設定

source: SmallRye JWT authentication
ja_jp: SmallRye JWT 認証

source: SmallRye JWT authentication mechanism
ja_jp: SmallRye JWT 認証メカニズム

source: SmallRye JWT provides more properties that can be used to customize the token processing:
ja_jp: SmallRye JWT は、トークン処理のカスタマイズに使用できるプロパティーを他にも提供します。

source: SmallRye JWT provides more properties which can be used to customize the token processing:
ja_jp: SmallRye JWTには、トークン処理をカスタマイズするために使用できる、より多くのプロパティーが用意されています。

source: SmallRye JWT supports the following properties which can be used to customize the way claims are signed and/or encrypted:
ja_jp: SmallRye JWT は、クレームの署名や暗号化の方法をカスタマイズするために使用できる次のプロパティーをサポートしています。

source: SmallRye JWT supports the following properties, which can be used to customize how claims are signed or encrypted:
ja_jp: SmallRye JWT は、クレームの署名または暗号化の方法をカスタマイズするために使用できる次のプロパティーをサポートしています。

source: SmallRye Metrics allows applications to gather metrics and statistics that provide insights into what is happening inside an application. The metrics can be read remotely using the JSON or OpenMetrics format to be processed by additional tools such as Prometheus and stored for analysis and visualization.
ja_jp: SmallRye Metricsを使用すると、アプリケーション内部で何が起こっているかを把握するための指標や統計情報を収集できます。メトリクスは、JSONまたはOpenMetrics形式を使用してリモートで読み取り、Prometheusなどの追加ツールで処理し、分析および可視化のために保存することができます。

source: SmallRye OpenAPI users often request the ability to save the generated API document.
ja_jp: SmallRye OpenAPIのユーザーは、生成されたAPIドキュメントを保存する機能をしばしば要求します。

source: SmallRye Reactive Messaging - AMQP Connector
ja_jp: SmallRye Reactive Messaging - AMQP コネクタ

source: SmallRye Reactive Messaging - MQTT Connector
ja_jp: SmallRye Reactive Messaging - MQTT コネクター

source: SmallRye Reactive Messaging 2.5.0 and Mutiny 0.11.0
ja_jp: SmallRye Reactive Messaging 2.5.0 と Mutiny 0.11.0

source: SmallRye Reactive Messaging 3.13 and Kafka 3
ja_jp: SmallRye Reactive Messaging 3.13とKafka 3

source: SmallRye Reactive Messaging `checkpoint` commit strategy allows consumer applications to process messages in a stateful manner, while also respecting Kafka consumer scalability. An incoming channel with `checkpoint` commit strategy persists consumer offsets on an external <<state-stores,state store>>, such as a relational database or a key-value store. As a result of processing consumed records, the consumer application can accumulate an internal state for each topic-partition assigned to the Kafka consumer. This local state will be periodically persisted to the state store and will be associated with the offset of the record that produced it.
ja_jp: SmallRye Reactive Messaging `checkpoint` コミットストラテジーは、コンシューマーアプリケーションがステートフルにメッセージを処理できるようにし、同時に Kafka コンシューマーのスケーラビリティーも尊重します。 `checkpoint` コミットストラテジーを使用する着信チャンネルは、コンシューマーのオフセットをリレーショナルデータベースや key-value ストアなどの外部 <<state-stores,state store>> に永続化します。 消費されたレコードの処理結果として、コンシューマーアプリケーションは Kafka コンシューマーに割り当てられた topic-partition ごとに内部ステートを蓄積できます。 このローカルステートは定期的にステートストアに永続化され、それを生成したレコードのオフセットに関連付けられます。

source: SmallRye Reactive Messaging enables implementing custom commit strategies. See https://smallrye.io/smallrye-reactive-messaging/latest/kafka/receiving-kafka-records/#acknowledgement[SmallRye Reactive Messaging documentation] for more information.
ja_jp: Smallrye Reactive Messaging を使用すると、カスタムコミットストラテジーを実装できます。 詳細は、 https://smallrye.io/smallrye-reactive-messaging/latest/kafka/receiving-kafka-records/#acknowledgement[SmallRye Reactive Messaging ドキュメント] を参照してください。

source: SmallRye Reactive Messaging enables implementing custom failure strategies. See https://smallrye.io/smallrye-reactive-messaging/latest/kafka/receiving-kafka-records/#acknowledgement[SmallRye Reactive Messaging documentation] for more information.
ja_jp: Smallrye Reactive Messaging を使用すると、カスタム 失敗戦略を実装できます。詳細は、 https://smallrye.io/smallrye-reactive-messaging/latest/kafka/receiving-kafka-records/#acknowledgement[SmallRye Reactive Messaging のドキュメント] を参照してください。

source: SmallRye Reactive Messaging has been upgraded to 3.16.0.
ja_jp: SmallRye Reactive Messagingが3.16.0にアップグレードされました。

source: SmallRye Reactive Messaging supports decorating incoming and outgoing channels for implementing cross-cutting concerns such as monitoring, tracing or message interception. For more information on implementing decorators and message interceptors see the http://smallrye.io/smallrye-reactive-messaging/3.19.1/concepts/decorators/[SmallRye Reactive Messaging documentation].
ja_jp: SmallRye Reactive Messagingは、監視、トレース、メッセージのインターセプトなど、横断的な関心事を実装するために、受信および送信チャネルのデコレーターをサポートしています。デコレーターやメッセージインターセプターの実装に関する詳細は、 link:http://smallrye.io/smallrye-reactive-messaging/3.19.1/concepts/decorators/[SmallRye Reactive Messaging のドキュメント] を参照してください。

source: SmallRye Reactive Messaging supports decorating incoming and outgoing channels for implementing cross-cutting concerns such as monitoring, tracing or message interception. For more information on implementing decorators and message interceptors see the http://smallrye.io/smallrye-reactive-messaging/latest/concepts/decorators/[SmallRye Reactive Messaging documentation].
ja_jp: SmallRye Reactive Messagingは、監視、トレース、メッセージの傍受などの横断的な関心事を実装するために、送受信チャネルのデコレータをサポートしています。デコレータやメッセージインターセプタの実装に関する詳細は、 link:http://smallrye.io/smallrye-reactive-messaging/latest/concepts/decorators/[SmallRye Reactive Messagingのドキュメント] を参照してください。

source: SmallRye Reactive Messaging upgrade
ja_jp: SmallRye Reactive Messagingのアップグレード

source: SmallRye Reactive Messaging upgraded to 2.4.0 and Mutiny to 0.9.0
ja_jp: SmallRye Reactive Messaging が 2.4.0 に、Mutiny が 0.9.0 にアップグレード

source: SmallRye Reactive Messaging was upgraded to 2.4.0 which includes several improvements - including Cloud Event support for Kafka - and bugfixes and Mutiny to 0.9.0.
ja_jp: SmallRye Reactive Messaging は 2.4.0 にアップグレードされました。KafkaのCloud Event サポートを含むいくつかの改善、バグ修正などが含まれています。Mutinyは 0.9.0 へアップグレードされました。

source: SmallRye Reactive Messaging was upgraded to 2.5.0 which includes several improvements and Mutiny to 0.11.0.
ja_jp: SmallRye Reactive Messaging が 2.5.0 にアップグレードされました。これにより、いくつかの改善と Mutiny が 0.11.0 にアップグレードされました。

source: SmallRye Reactive Messaging was upgraded to 3.13 and the Kafka client has been upgraded to 3.0.0.
ja_jp: SmallRye Reactive Messagingが3.13にアップグレードされ、Kafkaクライアントが3.0.0にアップグレードされました。

source: SmallRye Reactive Streams Operators
ja_jp: SmallRye Reactive Streams オペレーター

source: SmallRye Reactive Type Converters
ja_jp: SmallRye Reactive 型コンバーター

source: SmallRye Stork is a _service discovery and client-side load-balancing framework_.
ja_jp: SmallRye Storkは、 _サービスディスカバリーとクライアントサイドロードバランシングのフレームワーク_ です。

source: SmallRye Stork meets Quarkus
ja_jp: SmallRye StorkとQuarkus

source: SmallRye Stork supports service registration backends like Consul and Eureka. Traditionally, developers link:{quickstarts-tree-url}/stork-programmatic-custom-registration-quickstart[had to explicitly configure and manually register] their service instances using code. With this feature, Quarkus applications can automatically register with a supported registry (e.g., Consul) during startup and deregister during shutdown — without writing boilerplate code.
ja_jp: SmallRye Stork は、Consul や Eureka などのサービス登録バックエンドをサポートしています。従来、開発者は link:{quickstarts-tree-url}/stork-programmatic-custom-registration-quickstart[コードを使用してサービスインスタンスを明示的に設定し、手動で登録] する必要がありました。この機能により、Quarkus アプリケーションは起動時にサポートされているレジストリー (例: Consul) へ自動的に登録し、シャットダウン時に登録解除できるようになります。ボイラープレートコードを書く必要はありません。

source: SmallRye Stork, our service discovery and client-side load-balancing framework has been bumped to 1.0.0. It comes with many improvements and a refined documentation:
ja_jp: サービスディスカバリーとクライアントサイドロードバランシングのフレームワーク、SmallRye Storkが1.0.0にバージョンアップしました。

source: Smaller image for native executables
ja_jp: ネイティブ実行可能ファイルのための小さなイメージ
